# 【毎日Python】Pythonで配列を縦方向に結合する方法｜numpy.vstack
#https://www.youtube.com/watch?v=eC3j80DW8YA

import numpy as np

a_1 = np.array([1,2,3,4,5])

a_2 = np.array([10,20,30,40,50])

#配列を宣言

np.vstack((a_1,a_2)) #配列を縦方向に結合
#array([[ 1,  2,  3,  4,  5],
#       [10, 20, 30, 40, 50]])

a_1 = np.array([1,2,3,4,5])

a_3 = np.array([[60,61,62,63,64],
                [70,71,72,73,74],
                [80,81,82,83,84]])

#配列を宣言

np.vstack((a_1,a_3)) #配列を縦方向に結合
#array([[ 1,  2,  3,  4,  5],
#       [60, 61, 62, 63, 64],
#       [70, 71, 72, 73, 74],
#       [80, 81, 82, 83, 84]])

a_1 = np.array([1,2,3,4,5])

a_2 = np.array([10,20,30,40,50])

a_3 = np.array([[60,61,62,63,64],
                [70,71,72,73,74],
                [80,81,82,83,84]])

#配列を宣言

np.vstack((a_1,a_2,a_3)) #配列を縦方向に結合
#array([[ 1,  2,  3,  4,  5],
#       [10, 20, 30, 40, 50],
#       [60, 61, 62, 63, 64],
#       [70, 71, 72, 73, 74],
#       [80, 81, 82, 83, 84]])